# vi: ft=ruby

cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/livecheck"
tap "homebrew/services"
tap "romkatv/powerlevel10k"

brew "mas"


# mas {{{
mas "Xcode", id: 497799835
mas "Developer", id: 640199958
mas "Messenger", id: 1480068668
mas "Twitter", id: 1482454543
mas "NextDNS", id: 1464122853
mas "Cleaner for Xcode", id: 1296084683
# mas }}}


# cask {{{
cask "iterm2"
cask "1password"
cask "1password-cli"
cask "authy"
cask "dropbox"
cask "alfred"

cask "google-chrome"
cask "firefox"

cask "iina"
cask "vlc"
cask "spotify"
cask "blackhole"
cask "obs"

cask "spectacle"

cask "whatsapp"
cask "slack"
cask "discord"
cask "notion"
cask "github"

cask "vimr"

cask "gpg-suite"
brew "pinentry-mac"

cask "font-fira-code"
cask "font-noto-sans"
# cask }}}


# brew {{{
brew "cmake"
brew "openssl"
brew "coreutils"
brew "gnu-sed"
brew "gnu-tar"
brew "findutils"

brew "zsh"
brew "powerlevel10k"
brew "tmux"
brew "reattach-to-user-namespace"

brew "trash"

brew "vim"
brew "neovim", args: ["HEAD"]

brew "git"
brew "git-lfs"
brew "ghq"

brew "cabal-install"
brew "haskell-stack"

brew "python"
brew "python@3.8"
brew "ipython"

brew "go"

brew "ruby"
brew "ruby-build"

brew "pyenv"
brew "pyenv-virtualenv"
brew "nvm"
brew "rbenv"
brew "rustup-init"

brew "ffmpeg"

brew "ripgrep"
brew "fd"

brew "jq"
brew "lsd"
brew "fzf"
brew "tree"

brew "wget"
brew "curl"
brew "ldns"
brew "telnet"
brew "htop"

brew "grc"
brew "bat"
brew "pygments"

brew "docker"
brew "docker-compose"
# brew }}}
