{
  "AfterColors.vim": { "branch": "master" },
  "AnsiEsc": { "branch": "master" },
  "BetterLua.vim": { "branch": "master" },
  "FastFold": { "branch": "master" },
  "FixCursorHold.nvim": { "branch": "master" },
  "FoldText": { "branch": "master" },
  "ale": { "branch": "master" },
  "apiblueprint.vim": { "branch": "master" },
  "applescript.vim": { "branch": "master" },
  "base16-vim": { "branch": "master" },
  "braceless.vim": { "branch": "master" },
  "bufferize.vim": { "branch": "main" },
  "bufferline.nvim": { "branch": "main" },
  "chromatica.nvim": { "branch": "master" },
  "colorbuddy.vim": { "branch": "master" },
  "context_filetype.vim": { "branch": "master" },
  "coq.artifacts": { "branch": "artifacts" },
  "coq_nvim": { "branch": "coq" },
  "csv.vim": { "branch": "master" },
  "diffconflicts": { "branch": "master" },
  "editorconfig-vim": { "branch": "master" },
  "emmet-vim": { "branch": "master" },
  "fern-git-status.vim": { "branch": "master" },
  "fern-hijack.vim": { "branch": "master" },
  "fern-mapping-collapse-or-leave.vim": { "branch": "master" },
  "fern-mapping-project-top.vim": { "branch": "master" },
  "fern-preview.vim": { "branch": "main" },
  "fern-renderer-nerdfont.vim": { "branch": "master" },
  "fern-ssh": { "branch": "master" },
  "fern.vim": { "branch": "main" },
  "fidget.nvim": { "branch": "main" },
  "fzf": { "branch": "master" },
  "fzf-preview.vim": { "branch": "main" },
  "fzf.vim": { "branch": "master" },
  "gitsigns.nvim": { "branch": "main" },
  "glyph-palette.vim": { "branch": "master" },
  "html5.vim": { "branch": "master" },
  "i3-vim-syntax": { "branch": "master" },
  "impatient.nvim": { "branch": "main" },
  "incsearch-easymotion.vim": { "branch": "master" },
  "incsearch-fuzzy.vim": { "branch": "master" },
  "incsearch.vim": { "branch": "master" },
  "indent-blankline.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "libclang-vim": { "branch": "master" },
  "lsp-format.nvim": { "branch": "master" },
  "lsp_signature.nvim": { "branch": "master" },
  "lspkind-nvim": { "branch": "master" },
  "lualine.nvim": { "branch": "master" },
  "mason-lspconfig.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "neocodeium": { "branch": "main" },
  "neodev.nvim": { "branch": "main" },
  "nerdcommenter": { "branch": "master" },
  "nerdfont.vim": { "branch": "master" },
  "nginx.vim": { "branch": "master" },
  "nightfox.nvim": { "branch": "main" },
  "nvim-autopairs": { "branch": "master" },
  "nvim-bqf": { "branch": "main" },
  "nvim-code-action-menu": { "branch": "main" },
  "nvim-lightbulb": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-lsputils": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-endwise": { "branch": "master" },
  "nvim-ts-autotag": { "branch": "main" },
  "nvim-web-devicons": { "branch": "master" },
  "pgsql.vim": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
  "popfix": { "branch": "master" },
  "popup.nvim": { "branch": "master" },
  "python-mode": { "branch": "develop" },
  "render-markdown.nvim": { "branch": "main" },
  "rust.vim": { "branch": "master" },
  "salt-vim": { "branch": "master" },
  "sqlite.lua": { "branch": "master" },
  "tabular": { "branch": "master" },
  "telescope-emoji.nvim": { "branch": "master" },
  "telescope-frecency.nvim": { "branch": "master" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope.nvim": { "branch": "master" },
  "traces.vim": { "branch": "master" },
  "typescript-vim": { "branch": "master" },
  "undotree": { "branch": "master" },
  "vim-afterimage": { "branch": "master" },
  "vim-angry": { "branch": "master" },
  "vim-caddyfile": { "branch": "master" },
  "vim-clap": { "branch": "master" },
  "vim-clojure-highlight": { "branch": "master" },
  "vim-closetag": { "branch": "master" },
  "vim-coffee-script": { "branch": "master" },
  "vim-easy-align": { "branch": "master" },
  "vim-enmasse": { "branch": "master" },
  "vim-exchange": { "branch": "master" },
  "vim-fetch": { "branch": "master" },
  "vim-floaterm": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-gitignore": { "branch": "master" },
  "vim-haskell-indent": { "branch": "master" },
  "vim-jinja": { "branch": "master" },
  "vim-jsx-typescript": { "branch": "master" },
  "vim-keeppad": { "branch": "master" },
  "vim-kitty": { "branch": "main" },
  "vim-kitty-navigator": { "branch": "master" },
  "vim-localvimrc": { "branch": "main" },
  "vim-markdown": { "branch": "master" },
  "vim-markdown-folding": { "branch": "master" },
  "vim-misc": { "branch": "master" },
  "vim-mkdir": { "branch": "main" },
  "vim-niceblock": { "branch": "master" },
  "vim-obsession": { "branch": "master" },
  "vim-operator-flashy": { "branch": "master" },
  "vim-operator-user": { "branch": "master" },
  "vim-plist": { "branch": "master" },
  "vim-polyglot": { "branch": "master" },
  "vim-prosession": { "branch": "master" },
  "vim-ps1": { "branch": "master" },
  "vim-pug": { "branch": "master" },
  "vim-repeat": { "branch": "master" },
  "vim-space": { "branch": "master" },
  "vim-startuptime": { "branch": "master" },
  "vim-stylus": { "branch": "master" },
  "vim-surround": { "branch": "master" },
  "vim-syntax-expand": { "branch": "master" },
  "vim-systemd-syntax": { "branch": "master" },
  "vim-table-mode": { "branch": "master" },
  "vim-terraform": { "branch": "master" },
  "vim-textobj-between": { "branch": "master" },
  "vim-textobj-clang": { "branch": "master" },
  "vim-textobj-comment": { "branch": "master" },
  "vim-textobj-fold": { "branch": "master" },
  "vim-textobj-function": { "branch": "master" },
  "vim-textobj-function-clang": { "branch": "master" },
  "vim-textobj-indent": { "branch": "master" },
  "vim-textobj-lastpat": { "branch": "master" },
  "vim-textobj-line": { "branch": "master" },
  "vim-textobj-pastedtext": { "branch": "master" },
  "vim-textobj-path": { "branch": "master" },
  "vim-textobj-quotes": { "branch": "master" },
  "vim-textobj-space": { "branch": "master" },
  "vim-textobj-syntax": { "branch": "master" },
  "vim-textobj-uri": { "branch": "master" },
  "vim-textobj-user": { "branch": "master" },
  "vim-textobj-variable-segment": { "branch": "main" },
  "vim-tmux": { "branch": "master" },
  "vim-tmux-focus-events": { "branch": "master" },
  "vim-tmux-navigator": { "branch": "master" },
  "vim-toml": { "branch": "main" },
  "vim-twig": { "branch": "master" },
  "vim-vertical-move": { "branch": "master" },
  "vim-vyper": { "branch": "master" },
  "virtual-types.nvim": { "branch": "master" },
  "visualrepeat": { "branch": "master" }
}
